<?php

function validateIdCard($value)
{
    if (!preg_match('/^\d{17}[0-9xX]$/', $value)) { //基本格式校验
        return false;
    }

    $parsed = date_parse(substr($value, 6, 8));
    if (!(isset($parsed['warning_count'])
        && $parsed['warning_count'] == 0)) { //年月日位校验
        return false;
    }

    $base = substr($value, 0, 17);

    $factor = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2];

    $tokens = ['1', '0', 'X', '9', '8', '7', '6', '5', '4', '3', '2'];

    $checkSum = 0;
    for ($i=0; $i<17; $i++) {
        $checkSum += intval(substr($base, $i, 1)) * $factor[$i];
    }

    $mod = $checkSum % 11;
    $token = $tokens[$mod];

    $lastChar = strtoupper(substr($value, 17, 1));

    return ($lastChar === $token); //最后一位校验位校验
}

function isCarLicense($license)
{
    if (empty($license)) {
        return false;
    }
    $regular = "/[京津冀晋蒙辽吉黑沪苏浙皖闽赣鲁豫鄂湘粤桂琼川贵云渝藏陕甘青宁新使]{1}[A-Z]{1}[0-9a-zA-Z]{5}$/u";
    preg_match($regular, $license, $match);
    if (isset($match[0])) {
        return true;
    }

    //新能源
    $regular = "/[京津冀晋蒙辽吉黑沪苏浙皖闽赣鲁豫鄂湘粤桂琼川贵云渝藏陕甘青宁新]{1}[A-Z]{1}[DF]{1}[0-9a-zA-Z]{5}$/u";
    preg_match($regular, $license, $match);
    if (isset($match[0])) {
        return true;
    }

    $regular = "/[京津冀晋蒙辽吉黑沪苏浙皖闽赣鲁豫鄂湘粤桂琼川贵云渝藏陕甘青宁新]{1}[-]{1}[A-Z]{1}[0-9a-zA-Z]{5}$/u";
    preg_match($regular, $license, $match);
    if (isset($match[0])) {
        return true;
    }

    return false;
}

function getJdWd($city)
{
    $cityJdWdArray = [
        '安徽'    =>['wd'=>'31.833227236' ,'jd'=>'117.225382556'],
        '北京'    =>['wd'=>'39.907582828','jd'=>'116.396278113'],
        '重庆'    =>['wd'=>'29.584243617','jd'=>'106.552742562'],
        '福建'    =>['wd'=>'26.087646551','jd'=>'119.294977006'],
        '甘肃'    =>['wd'=>'36.06862','jd'=>'103.834837015'],
        '广东'	=>['wd'=>'23.1337996','jd'=>'113.264003133'],
        '广西'	=>['wd'=>'22.822332115','jd'=>'108.367031241'],
        '贵州'	=>['wd'=>'26.651206357','jd'=>'106.629748777'],
        '海南'	=>['wd'=>'20.031296614','jd'=>'110.33519473'],
        '河北'	=>['wd'=>'38.052514721','jd'=>'114.510778463'],
        '河南'	=>['wd'=>'34.750117438','jd'=>'113.625821885'],
        '黑龙江'  =>['wd'=>'45.8068887155405','jd'=>'126.530422423016'],
        '湖北'    =>['wd'=>'30.602362201','jd'=>'114.303430004'],
        '湖南'     =>['wd'=>'28.242409436','jd'=>'112.933453806'],
        '吉林'    =>['wd'=>'43.8451438670654','jd'=>'125.352175361688'],
        '江苏'     =>['wd'=>'32.060487154','jd'=>'118.791055713'],
        '江西'     =>['wd'=>'28.697343237','jd'=>'115.855008674'],
        '辽宁'  	 =>['wd'=>'41.843668658','jd'=>'123.470066583'],
        '内蒙古'    =>['wd'=>'40.854225087','jd'=>'111.747841898'],
        '宁夏'     =>['wd'=>'38.493732055','jd'=>'106.229494689'],
        '青海'    =>['wd'=>'36.637156772','jd'=>'101.785092875'],
        '山东' =>['wd'=>'36.674377704','jd'=>'116.991151021'],
        '山西'	=>['wd'=>'37.87601518','jd'=>'112.546635233'],
        '陕西'	=>['wd'=>'34.272091764','jd'=>'108.940092354'],
        '上海'	=>['wd'=>'31.237101598','jd'=>'121.472696621'],
        '四川'	=>['wd'=>'30.6672631','jd'=>'104.06518791'],
        '天津'	=>['wd'=>'39.089389984','jd'=>'117.195369004'],
        '西藏'		=>['wd'=>'29.654136405','jd'=>'91.11474124'],
        '新疆'	=>['wd'=>'43.834482828','jd'=>'87.615730096'],
        '云南'		=>['wd'=>'25.045835583','jd'=>'102.71890305'],
        '浙江'		=>['wd'=>'30.280161578','jd'=>'120.154995513'],
        '香港' =>['wd'=>'21.23','jd'=>'115.12'],
        '澳门'	=>['wd'=>'22.33','jd'=>'113.33'],
        '台湾'	=>['wd'=>'25.03','jd'=>'121.30']
    ];
    return $cityJdWdArray[$city];
}

function getProvinceByIdCard($idCard)
{
    $index = substr($idCard,0,2);
    $area = array(
        11 => "北京",
        12 => "天津",
        13 => "河北",
        14 => "山西",
        15 => "内蒙古",
        21 => "辽宁",
        22 => "吉林",
        23 => "黑龙江",
        31 => "上海",
        32 => "江苏",
        33 => "浙江",
        34 => "安徽",
        35 => "福建",
        36 => "江西",
        37 => "山东",
        41 => "河南",
        42 => "湖北",
        43 => "湖南",
        44 => "广东",
        45 => "广西",
        46 => "海南",
        50 => "重庆",
        51 => "四川",
        52 => "贵州",
        53 => "云南",
        54 => "西藏",
        61 => "陕西",
        62 => "甘肃",
        63 => "青海",
        64 => "宁夏",
        65 => "新疆",
        71 => "台湾",
        81 => "香港",
        82 => "澳门",
        91 => "国外"
    );
    return $area[$index];
}